# Core tools
brew "fish"
brew "starship"
brew "zoxide"
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "jq"
brew "btop"
brew "gh"
brew "displayplacer"
brew "mole"

# AWS/Cloud
brew "granted"

# Secrets
cask "1password-cli"

# Containers
cask "orbstack"

# Window manager
cask "aerospace"

# Display & input
cask "betterdisplay"
cask "mac-mouse-fix"
