# Taps
tap "anomalyco/tap"
tap "marcus/tap"

# Core tools
brew "rust"
brew "fish"
brew "starship"
brew "zoxide"
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "jq"
brew "btop"
brew "gh"
brew "displayplacer"
brew "mole"
brew "fastfetch"
brew "glow"
brew "lazygit"
brew "lazydocker"
brew "httpie"
brew "thefuck"
brew "wtfutil"
brew "hyperfine"
brew "tlrc"
brew "frpc"
brew "duti"
brew "opencode"
brew "switchaudio-osx"
brew "marcus/tap/nightshift"

# AWS/Cloud
brew "granted"

# Secrets
cask "1password-cli"

# Containers
cask "orbstack"

# Window manager
cask "aerospace"

# Display & input
cask "betterdisplay"
cask "mac-mouse-fix"
